run/hartmannLMB/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     lmbFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT 0.041666666666666664;

writeControl    adjustableRunTime;
writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1.0;

maxAlphaCo      1.0;

maxDeltaT       0.01;

functions
{
/*	friction
	{
	   patches	   (leftWall rightWall lowerWall defaultFaces atmosphere);
	   CofR		   (0.098 0 0);
	   writeControl	   timeStep;
	   writeInterval    1;
	   // Field names
	   p		   p;
	   U		   U;
	   rho		   rhoInf;
	   rhoInf	   8900;

	   type		   forces;
	   log 		   true;
	}
	*/
    minMaxPd
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name pd;
    }
    minMaxU
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name U;
    }
    minMaxAlpha1
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name alpha1;
    }
    /*
    minMaxK
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name k;
    }
    minMaxNuT
    {
        type minMaxField;
        functionObjectLibs ("libfieldFunctionObjects.so");
        name nut;
    }
    */
}

//# include   "sampling"

// ************************************************************************* //
