run/hartmannLMB/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat     raw;

sets
(
    line_centreProfile
    {
        type            uniform;

        axis            distance;
        start           (10.001 -1 0.01);
        end             (10.001 1 0.01);
        nPoints         100;
    }
);

surfaceFormat null;

surfaces
();

fields
(
    Ux
);

// ************************************************************************* //
